CRNBuilder-commented/data/Sandia_flame_D/case/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
113400
(
0.0004576546
0.0004576546
0.0004576546
0.0004576546
0.0004576546
0.0004576546
0.0004576546
0.0004576546
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    fuelinlet
    {
        type            calculated;
        value           uniform 0;
    }
    innerwall
    {
        type            calculated;
        value           uniform 0;
    }
    pilotinlet
    {
        type            calculated;
        value           uniform 0;
    }
    outerwall
    {
        type            calculated;
        value           uniform 0;
    }
    airinlet
    {
        type            calculated;
        value           uniform 0;
    }
    leftside
    {
        type            calculated;
        value           nonuniform List<scalar> 
450
(
0.0004576546
0.001374085
0.0022927604
0.0032136864
0.0041368685
0.0050623121
0.005990023
0.0069200065
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
252
(
0.75
0.75
0.75
0.75
0.75
0.75
0.75
0.75
...
)
;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
